Revit 2027 API
RebarConstraint.IsToCustomTarget Method
 Checks if the RebarConstraintType of the RebarConstraint is 'ToCustomTarget'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToCustomTarget()
Public Function IsToCustomTarget As Boolean
public:
bool IsToCustomTarget()
member IsToCustomTarget : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToCustomTarget', false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace